Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CM5112GC00100_DFP/component/ac.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* CHANNEL register API structure */
typedef struct
{
  __IO  uint32_t                       AC_COMPCTRL[2];     /* Offset: 0x00 (R/W  32) Pair n Comparator Control 0 */
  __IO  uint32_t                       AC_DACCTRL;         /* Offset: 0x08 (R/W  32) Dac n Control */
  __IO  uint32_t                       AC_WINCTRL;         /* Offset: 0x0C (R/W  32) Window Monitor  n Control */
} ac_channel_registers_t;

#define AC_CHANNEL_NUMBER 1

/* AC register API structure */
typedef struct
{  /* Analog Comparator Controller */
  __IO  uint32_t                       AC_CTRLA;           /* Offset: 0x00 (R/W  32) Control A */
  __IO  uint32_t                       AC_CTRLB;           /* Offset: 0x04 (R/W  32) Control B */
  __IO  uint32_t                       AC_CTRLC;           /* Offset: 0x08 (R/W  32) Control C */
  __IO  uint32_t                       AC_EVCTRL;          /* Offset: 0x0C (R/W  32) Event Control */
  __IO  uint32_t                       AC_INTENCLR;        /* Offset: 0x10 (R/W  32) Interrupt Enable Clear */
  __IO  uint32_t                       AC_INTENSET;        /* Offset: 0x14 (R/W  32) Interrupt Enable Set */
  __IO  uint32_t                       AC_INTFLAG;         /* Offset: 0x18 (R/W  32) Interrupt Flag Status and Clear */
  __I   uint32_t                       AC_STATUSA;         /* Offset: 0x1C (R/   32) Status A */
  __I   uint32_t                       AC_STATUSB;         /* Offset: 0x20 (R/   32) Status B */
  __IO  uint32_t                       AC_DBGCTRL;         /* Offset: 0x24 (R/W  32) Debug Control */
  __I   uint32_t                       AC_SYNCBUSY;        /* Offset: 0x28 (R/   32) Synchronization Busy */
  __I   uint8_t                        Reserved1[0x04];
        ac_channel_registers_t         CHANNEL[AC_CHANNEL_NUMBER]; /* Offset: 0x30  */
} ac_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMGC00_AC_COMPONENT_H_ */
